
## Plan Result (prod)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 6 to change, 1 to destroy.</code></pre>

* Create
  * module.elastic.module.elastic_action_group.azurerm_resource_group_template_deployment.action-group
* Update
  * module.elastic.azurerm_network_security_rule.aks_rule
  * module.elastic.azurerm_network_security_rule.apps_rule
  * module.elastic.azurerm_network_security_rule.jenkins_rule
  * module.elastic.azurerm_network_security_rule.kibana_tight_kibana_rule[0]
  * module.elastic.azurerm_network_security_rule.kibana_tight_ssh_rule[0]
  * module.elastic.azurerm_resource_group.elastic-resourcegroup
* Delete
  * module.elastic.module.elastic_action_group.azurerm_template_deployment.action-group


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.elastic.data.azurerm_application_security_group.data_asg will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_application_security_group" "data_asg"  {
      ~ id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg" -> (known after apply)
      ~ location            = "uksouth" -> (known after apply)
        name                = "ccd-data-asg"
      ~ tags                = {
          - "provider" = "648D2193-0CE0-4EFB-8A82-AF9792184FD9"
        } -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.elastic.data.azurerm_application_security_group.kibana_asg[0] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_application_security_group" "kibana_asg"  {
      ~ id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-kibana-asg" -> (known after apply)
      ~ location            = "uksouth" -> (known after apply)
        name                = "ccd-kibana-asg"
      ~ tags                = {
          - "provider" = "648D2193-0CE0-4EFB-8A82-AF9792184FD9"
        } -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.elastic.data.azurerm_network_security_group.cluster_nsg will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_network_security_group" "cluster_nsg"  {
      ~ id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/networkSecurityGroups/ccd-cluster-nsg" -> (known after apply)
      ~ location            = "uksouth" -> (known after apply)
        name                = "ccd-cluster-nsg"
      ~ security_rule       = [
          - {
              - access                                     = "Allow"
              - description                                = "Allows SSH traffic"
              - destination_address_prefix                 = ""
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = [
                  - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
                ]
              - destination_port_range                     = "22"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "SSH"
              - priority                                   = 100
              - protocol                                   = "TCP"
              - source_address_prefix                      = "VirtualNetwork"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - description                                = "Allows ElasticSeach communication only between nodes"
              - destination_address_prefix                 = ""
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = [
                  - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
                ]
              - destination_port_range                     = ""
              - destination_port_ranges                    = [
                  - "9200",
                  - "9300",
                ]
              - direction                                  = "Inbound"
              - name                                       = "ElasticClusterTransport"
              - priority                                   = 120
              - protocol                                   = "TCP"
              - source_address_prefix                      = ""
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = [
                  - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
                ]
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - description                                = "Allows ElasticSeach queries from the LoadBalancer.  Needed for LoadBalancer healthchecks."
              - destination_address_prefix                 = ""
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = [
                  - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
                ]
              - destination_port_range                     = ""
              - destination_port_ranges                    = [
                  - "9200",
                  - "9300",
                ]
              - direction                                  = "Inbound"
              - name                                       = "LB_To_ES"
              - priority                                   = 160
              - protocol                                   = "TCP"
              - source_address_prefix                      = "AzureLoadBalancer"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Deny"
              - description                                = "Deny all traffic that is not Elastic or SSH from anywhere"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "*"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "DenyAllOtherTraffic"
              - priority                                   = 300
              - protocol                                   = "*"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
        ] -> (known after apply)
      ~ tags                = {
          - "provider" = "648D2193-0CE0-4EFB-8A82-AF9792184FD9"
        } -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.elastic.data.azurerm_network_security_group.kibana_nsg[0] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_network_security_group" "kibana_nsg"  {
      ~ id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/networkSecurityGroups/ccd-kibana-nsg" -> (known after apply)
      ~ location            = "uksouth" -> (known after apply)
        name                = "ccd-kibana-nsg"
      ~ security_rule       = [
          - {
              - access                                     = "Allow"
              - description                                = "Allows inbound SSH traffic from VirtualNetwork"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "22"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "SSH"
              - priority                                   = 100
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "VirtualNetwork"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - description                                = "Allows inbound Kibana HTTP traffic from VirtualNetwork"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "5601"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "Kibana"
              - priority                                   = 200
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "VirtualNetwork"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
        ] -> (known after apply)
      ~ tags                = {
          - "provider" = "648D2193-0CE0-4EFB-8A82-AF9792184FD9"
        } -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.elastic.azurerm_network_security_rule.aks_rule will be updated in-place
  ~ resource "azurerm_network_security_rule" "aks_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/networkSecurityGroups/ccd-cluster-nsg/securityRules/AKS_To_ES"
        name                                       = "AKS_To_ES"
      ~ source_address_prefixes                    = [
          - "10.13.0.0/20",
          - "10.13.16.0/20",
            # (2 unchanged elements hidden)
        ]
        # (13 unchanged attributes hidden)
    }

  # module.elastic.azurerm_network_security_rule.apps_rule will be updated in-place
  ~ resource "azurerm_network_security_rule" "apps_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/networkSecurityGroups/ccd-cluster-nsg/securityRules/App_To_ES"
        name                                       = "App_To_ES"
        # (14 unchanged attributes hidden)
    }

  # module.elastic.azurerm_network_security_rule.jenkins_rule will be updated in-place
  ~ resource "azurerm_network_security_rule" "jenkins_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/networkSecurityGroups/ccd-cluster-nsg/securityRules/Jenkins_To_ES"
        name                                       = "Jenkins_To_ES"
      ~ source_address_prefix                      = "10.10.70.0/23" -> "10.10.76.0/23"
        # (14 unchanged attributes hidden)
    }

  # module.elastic.azurerm_network_security_rule.kibana_tight_kibana_rule[0] will be updated in-place
  ~ resource "azurerm_network_security_rule" "kibana_tight_kibana_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-kibana-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/networkSecurityGroups/ccd-kibana-nsg/securityRules/Bastion_only_Kibana"
        name                                       = "Bastion_only_Kibana"
        # (16 unchanged attributes hidden)
    }

  # module.elastic.azurerm_network_security_rule.kibana_tight_ssh_rule[0] will be updated in-place
  ~ resource "azurerm_network_security_rule" "kibana_tight_ssh_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-kibana-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/networkSecurityGroups/ccd-kibana-nsg/securityRules/Bastion_only_SSH"
        name                                       = "Bastion_only_SSH"
        # (16 unchanged attributes hidden)
    }

  # module.elastic.azurerm_resource_group.elastic-resourcegroup will be updated in-place
  ~ resource "azurerm_resource_group" "elastic-resourcegroup" {
        id       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod"
        name     = "ccd-elastic-search-prod"
      ~ tags     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/ccd-elastic-search.git"
          - "application"         = "core-case-data"
          - "businessArea"        = "CFT"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#ccd-questions-answers"
          - "environment"         = "production"
          - "lastUpdated"         = "2022-03-09T19:07:49Z"
          - "managedBy"           = "CCD"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.elastic.module.elastic_action_group.azurerm_resource_group_template_deployment.action-group will be created
  + resource "azurerm_resource_group_template_deployment" "action-group" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "es-ccd"
      + output_content      = (known after apply)
      + parameters_content  = (sensitive)
      + resource_group_name = "oms-automation"
      + template_content    = jsonencode(
            {
              + $schema        = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + actionGroupName      = {
                      + type = "string"
                    }
                  + emailReceiverAddress = {
                      + metadata = {
                          + description = "Email address of the receiver"
                        }
                      + type     = "string"
                    }
                  + emailReceiverName    = {
                      + metadata = {
                          + description = "Name of the email receiver"
                        }
                      + type     = "string"
                    }
                  + location             = {
                      + defaultValue = "global"
                      + type         = "string"
                    }
                  + shortName            = {
                      + type = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2017-04-01"
                      + location   = "[parameters('location')]"
                      + name       = "[parameters('actionGroupName')]"
                      + properties = {
                          + emailReceivers   = [
                              + {
                                  + emailAddress = "[parameters('emailReceiverAddress')]"
                                  + name         = "[parameters('emailReceiverName')]"
                                },
                            ]
                          + enabled          = true
                          + groupShortName   = "[parameters('shortName')]"
                          + smsReceivers     = []
                          + webhookReceivers = []
                        }
                      + tags       = {}
                      + type       = "microsoft.insights/actionGroups"
                    },
                ]
            }
        )
    }

  # module.elastic.module.elastic_action_group.azurerm_template_deployment.action-group will be destroyed
  - resource "azurerm_template_deployment" "action-group" {
      - deployment_mode     = "Incremental" -> null
      - id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/oms-automation/providers/Microsoft.Resources/deployments/es-ccd_prod" -> null
      - name                = "es-ccd_prod" -> null
      - outputs             = {} -> null
      - parameters          = {
          - "actionGroupName"      = "ccd_ElasticSearch_prod"
          - "emailReceiverAddress" = (sensitive)
          - "emailReceiverName"    = "Elasticsearch Alerts (ccd) - prod"
          - "location"             = "global"
          - "shortName"            = "es-ccd"
        } -> null
      - resource_group_name = "oms-automation" -> null
      - template_body       = jsonencode(
            {
              - $schema        = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - parameters     = {
                  - actionGroupName      = {
                      - type = "string"
                    }
                  - emailReceiverAddress = {
                      - metadata = {
                          - description = "Email address of the receiver"
                        }
                      - type     = "string"
                    }
                  - emailReceiverName    = {
                      - metadata = {
                          - description = "Name of the email receiver"
                        }
                      - type     = "string"
                    }
                  - location             = {
                      - defaultValue = "global"
                      - type         = "string"
                    }
                  - shortName            = {
                      - type = "string"
                    }
                }
              - resources      = [
                  - {
                      - apiVersion = "2017-04-01"
                      - location   = "[parameters('location')]"
                      - name       = "[parameters('actionGroupName')]"
                      - properties = {
                          - emailReceivers   = [
                              - {
                                  - emailAddress = "[parameters('emailReceiverAddress')]"
                                  - name         = "[parameters('emailReceiverName')]"
                                },
                            ]
                          - enabled          = true
                          - groupShortName   = "[parameters('shortName')]"
                          - smsReceivers     = []
                          - webhookReceivers = []
                        }
                      - tags       = {}
                      - type       = "microsoft.insights/actionGroups"
                    },
                ]
            }
        ) -> null
    }

Plan: 1 to add, 6 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":65,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->